{
  "filename": "mysteryRun",
  "banner_image": {
    "link": "/images/projectImages/mysteryRun/overview.jpg"
  },
  "date": "2023-05-29",
  "developers": 6,
  "links": [],
  "keywords": [
    "GPS tracking",
    "Unity",
    "Multiplayer",
    "Augmented reality",
    "GPS Game",
    "Bachelor project",
    "Project Organization",
    "Scrum"
  ],
  "header": "Mystery Run",
  "main_image": {
    "link": "/images/projectImages/mysteryRun/design.jpg",
    "header": "Implementation",
    "description": "Throughout the development of Mystery Run, effective project management was key to the game's success, with a strong focus on teamwork and structured workflows. The project adopted the Scrum framework, promoting an iterative and collaborative approach. This method enabled regular team meetings, sprint planning, and continuous feedback, ensuring a smooth and organized development process. The team was structured like a real-world work environment, with members assigned roles based on their expertise, including developers, designers, testers, and project managers. This setup not only reflected industry practices but also provided valuable experience in interdisciplinary collaboration and teamwork."
  },
  "images": [
    {
      "link": "/images/projectImages/mysteryRun/overview.jpg",
      "header": ""
    },
    {
      "link": "/images/projectImages/mysteryRun/play.jpg",
      "header": ""
    },
    {
      "link": "/images/projectImages/mysteryRun/game.jpg",
      "header": ""
    },
    {
      "link": "/images/projectImages/mysteryRun/map.jpg",
      "header": ""
    }
  ],
  "description": "My bachelor project, titled Mystery Run, was an innovative game app that merged the excitement of solving murder mysteries with real-world exploration. Players embarked on an immersive experience, solving intriguing cases by physically walking to different locations in real life. The app utilized geolocation technology to create a dynamic and engaging narrative that unfolded as players moved through various places, uncovering clues and piecing together the puzzle abou who is the murderer.",
  "description_short": "Mystery Run is a geolocation-based game app where players solve murder mysteries by exploring real-world locations and gathering clues.",
  "quote": "My bachelor project in M.Sc. Media Technology and Engineering!",
  "result": {
    "header": "Result",
    "description": "The incorporation of project management principles and Scrum methodology not only enhanced the efficiency of our development process but also instilled a sense of responsibility and accountability within the team. The development of the app not only yielded a captivating game app but also endowed us with essential skills in project management and teamwork. These skills are not only valuable for our academic endeavors but will also be instrumental in our forthcoming professional careers."
  },
  "video": {
    "title": "",
    "embed_ID": ""
  }
}
