{
  "filename": "reactNativePasswordValidator",
  "banner_image": {
    "link": "/images/projectImages/reactNativePasswordValidator/npm-banner.jpg"
  },
  "date": "2024-12-06",
  "developers": 2,
  "links": [
    {
      "type": "GitHub",
      "link": "https://github.com/rasmussvala/react-native-password-validator"
    },
    {
      "type": "ExternalLink",
      "link": "https://www.npmjs.com/package/react-native-password-validator"
    }
  ],
  "keywords": [
    "react-native",
    "npm",
    "Expo Go",
    "password validator",
    "App dev"
  ],
  "header": "A react-native password validator",
  "main_image": {
    "link": "/images/projectImages/reactNativePasswordValidator/password-validator.webp",
    "header": "Features",
    "description": "The component dynamically evaluates password strength on a scale from 0 to 1, based on customizable rules such as length, uppercase letters, special characters, and numbers. It allows you to modify strength and warning bar colors, and provides user-friendly recommendations for creating strong passwords. Additionally, it features an optional confirm-password field to ensure consistency and includes a visual indicator that adapts to the password's strength. With a mobile-friendly design and adjustable styles, this component offers a seamless, flexible solution for password validation."
  },
  "images": [
    {
      "link": "/images/projectImages/reactNativePasswordValidator/npm.jpg",
      "header": ""
    },
    {
      "link": "/images/projectImages/reactNativePasswordValidator/password-validator-1.jpg",
      "header": ""
    },
    {
      "link": "/images/projectImages/reactNativePasswordValidator/password-validator-2.jpg",
      "header": ""
    },
    {
      "link": "/images/projectImages/reactNativePasswordValidator/password-validator-3.jpg",
      "header": ""
    },
    {
      "link": "/images/projectImages/reactNativePasswordValidator/password-validator-4.jpg",
      "header": ""
    }
  ],
  "description": "I developed a customizable React Native component designed to evaluate and display password strength. This component offers dynamic status indicators, providing users with real-time feedback on their password strength. It also includes password recommendations to help users create stronger passwords. Additionally, the component supports password confirmation functionality with visual feedback, ensuring a seamless and user-friendly experience. This tool has been launched on npm, making it easy for developers to integrate into their projects with a simple 'npm install'.",
  "description_short": "A customizable React Native component for password strength evaluation with dynamic indicators, recommendations, and visual feedback for confirmation. This tool has been launched on npm.",
  "quote": "Check out how to nmp install it and try it out!",
  "result": {
    "header": "",
    "description": ""
  },
  "video": {
    "title": "",
    "embed_ID": ""
  }
}
